tap "brewsci/bio"
tap "nik-rev/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GNU compiler collection
brew "gcc"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tools for genome arithmetic (set theory on the genome)
brew "bedtools"
# Burrow-Wheeler Aligner for pairwise alignment of DNA
brew "bwa"
# GNU File, Shell, and Text utilities
brew "coreutils"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Command-line fuzzy finder written in Go
brew "fzf"
# File format designed to store large amounts of data
brew "hdf5"
# C library for high-throughput sequencing data formats
brew "htslib"
# Interactive Genomics Viewer
brew "igv"
# Linux virtual machines
brew "lima"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Minify and secure Docker images
brew "mintoolkit"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Reproducible scientific workflows
brew "nextflow"
# High-level interpreted language for numerical computing
brew "octave"
# Development kit for the Java programming language
brew "openjdk@17"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Data tools for INSDC Sequence Read Archive
brew "sratoolkit"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Command-line tool similar to Neofetch for obtaining information about your country
brew "nik-rev/tap/countryfetch"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Tool for browsing and editing HDF files
cask "hdfview"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
